rlcamp/samd51_strobe/samd51_init.c
/* attempts to provide workalike subset of functionality in adafruit samd core, which is in
 turn derived from cmsis. significant deviations should be noted

 ideally, this file should be able to be used in the following scenarios:
 - with a Makefile using upstream cmsis/atmel/gcc
 - with the same Makefile using older cmsis/atmel/gcc as packaged by adafruit
 - within a sketch in the arduino ide, using the adafruit samd core
 */

#if __has_include(<component-version.h>)
/* as invoked by Makefile, regardless of cmsis-atmel version */
#include <component-version.h>
#include <samd51.h>
#else
/* as invoked by a certain ide, in case people want to use it to test modules in isolation */
#include <samd51/include/component-version.h>
#include <samd51/include/samd51.h>
#endif

/* symbols provided by linker script, referred to within Reset_Handler and exception_table.
 deviation from cmsis: these are the symbol names provided by the adafruit linker script,
 with which we want to remain compatible */

extern unsigned char __etext[]; /* where data comes from in flash */
extern unsigned char __data_start__[], __data_end__[]; /* where data goes in RAM */
extern unsigned char __bss_start__[], __bss_end__[]; /* where bss goes in RAM */

/* execution nominally starts here on reset (actually when exiting bootloader) */
__attribute((noreturn)) void Reset_Handler(void) {
    /* copy data section from flash to sram */
    if ((uintptr_t)__etext != (uintptr_t)__data_start__)
        __builtin_memcpy(__data_start__, __etext, (uintptr_t)__data_end__ - (uintptr_t)__data_start__);

    /* clear the bss section in sram */
    __builtin_memset(__bss_start__, 0, (uintptr_t)__bss_end__ - (uintptr_t)__bss_start__);

    /* enable floating point and flush state */
    SCB->CPACR |= (0xFu << 20);
    __DSB();
    __ISB();

    /* deviation from upstream cmsis: do clock init before C or C++ constructors are run */
    SystemInit();

    /* deviation from adafruit samd core: run the constructors before main(), rather than
     doing both clock init and constructors in main() */
    extern void __libc_init_array();
    __libc_init_array();

    /* note that this can be the default arduino main but should NOT be the adafruit main,
     which expects to call the above two functions internally. if using this within adafruit
     core, you MUST also override main(), otherwise constructors will be called twice */
    extern int main(void);
    main();

    /* hopefully we never get here but if we do, just sleep forever */
    while (1) __WFI();
}

/* default dummy handler, hangs forever if encountered */
static void Dummy_Handler(void) { while (1) __WFI(); }

/* default empty handler, returns harmless if encountered */
static void Empty_Handler(void) { }

/* upstream cmsis calls this NonMaskableInt_Handler, TODO: support both symbol names? */
__attribute__ ((weak, alias("Dummy_Handler"))) void NMI_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void HardFault_Handler(void);
/* upstream cmsis calls this MemManagement_Handler, TODO: support both symbol names? */
__attribute__ ((weak, alias("Dummy_Handler"))) void MemManage_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void BusFault_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void UsageFault_Handler(void);
/* upstream cmsis calls this SVCall_Handler, TODO: support both symbol names? */
__attribute__ ((weak, alias("Dummy_Handler"))) void SVC_Handler(void);
/* upstream cmsis calls this DebugMonitor_Handler, TODO: support both symbol names? */
__attribute__ ((weak, alias("Dummy_Handler"))) void DebugMon_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void PendSV_Handler(void);

__attribute__ ((weak, alias("Empty_Handler"))) void SysTick_Handler(void);

/* above are standard cortex-m4 handlers, below are samd51-specific peripherals handlers */
__attribute__ ((weak, alias("Dummy_Handler"))) void PM_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void MCLK_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void OSCCTRL_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void OSCCTRL_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void OSCCTRL_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void OSCCTRL_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void OSCCTRL_4_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void OSC32KCTRL_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SUPC_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SUPC_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void WDT_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void RTC_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_4_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_5_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_6_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_7_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_8_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_9_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_10_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_11_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_12_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_13_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_14_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EIC_15_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void FREQM_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void NVMCTRL_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void NVMCTRL_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void DMAC_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void DMAC_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void DMAC_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void DMAC_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void DMAC_4_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EVSYS_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EVSYS_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EVSYS_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EVSYS_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void EVSYS_4_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void PAC_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TAL_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TAL_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void RAMECC_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM0_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM0_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM0_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM0_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM1_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM1_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM1_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM1_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM2_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM2_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM2_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM2_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM3_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM3_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM3_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM3_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM4_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM4_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM4_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM4_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM5_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM5_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM5_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM5_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM6_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM6_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM6_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM6_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM7_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM7_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM7_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SERCOM7_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void CAN0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void CAN1_Handler(void);

