rlcamp/samd51_strobe/samd51_init.c
__attribute__ ((weak, alias("Empty_Handler"))) void USB_0_Handler(void);
__attribute__ ((weak, alias("Empty_Handler"))) void USB_1_Handler(void);
__attribute__ ((weak, alias("Empty_Handler"))) void USB_2_Handler(void);
__attribute__ ((weak, alias("Empty_Handler"))) void USB_3_Handler(void);

__attribute__ ((weak, alias("Dummy_Handler"))) void TCC0_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC0_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC0_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC0_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC0_4_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC0_5_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC0_6_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC1_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC1_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC1_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC1_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC1_4_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC2_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC2_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC2_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC2_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC3_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC3_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC3_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC4_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC4_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TCC4_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TC0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TC1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TC2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TC3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TC4_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TC5_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TC6_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TC7_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void PDEC_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void PDEC_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void PDEC_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void ADC0_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void ADC0_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void ADC1_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void ADC1_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void AC_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void DAC_0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void DAC_1_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void DAC_2_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void DAC_3_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void DAC_4_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void I2S_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void PCC_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void AES_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void TRNG_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void ICM_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void PUKCC_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void QSPI_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SDHC0_Handler(void);
__attribute__ ((weak, alias("Dummy_Handler"))) void SDHC1_Handler(void);

/* deviation from upstream cmsis: this is in .isr_vector instead of .vectors */
__attribute__((used, section(".isr_vector"))) const DeviceVectors exception_table = {
    /* initial stack pointer */
    .pvStack = (void *)(uintptr_t)(HSRAM_ADDR + HSRAM_SIZE),

    /* cortex-m4 handlers */
    .pfnReset_Handler = (void *)Reset_Handler, /* this table entry defines where pc starts */
#if BUILD_NUMBER == 61
    .pfnNMI_Handler = (void *)NMI_Handler,
#else
    .pfnNonMaskableInt_Handler = (void *)NMI_Handler,
#endif
    .pfnHardFault_Handler = (void *)HardFault_Handler,
#if BUILD_NUMBER == 61
    .pfnMemManage_Handler = (void *)MemManage_Handler,
#else
    .pfnMemManagement_Handler = (void *)MemManage_Handler,
#endif
    .pfnBusFault_Handler = (void *)BusFault_Handler,
    .pfnUsageFault_Handler = (void *)UsageFault_Handler,
#if BUILD_NUMBER == 61
    .pfnSVC_Handler = (void *)SVC_Handler,
    .pfnDebugMon_Handler = (void *)DebugMon_Handler,
#else
    .pfnSVCall_Handler = (void *)SVC_Handler,
    .pfnDebugMonitor_Handler = (void *)DebugMon_Handler,
#endif
    .pfnPendSV_Handler = (void *)PendSV_Handler,
    .pfnSysTick_Handler = (void *)SysTick_Handler,

    /* samd51-specific peripheral handlers */
    .pfnPM_Handler = (void *)PM_Handler,
    .pfnMCLK_Handler = (void *)MCLK_Handler,
    .pfnOSCCTRL_0_Handler = (void *)OSCCTRL_0_Handler,
    .pfnOSCCTRL_1_Handler = (void *)OSCCTRL_1_Handler,
    .pfnOSCCTRL_2_Handler = (void *)OSCCTRL_2_Handler,
    .pfnOSCCTRL_3_Handler = (void *)OSCCTRL_3_Handler,
    .pfnOSCCTRL_4_Handler = (void *)OSCCTRL_4_Handler,
    .pfnOSC32KCTRL_Handler = (void *)OSC32KCTRL_Handler,
    .pfnSUPC_0_Handler = (void *)SUPC_0_Handler,
    .pfnSUPC_1_Handler = (void *)SUPC_1_Handler,
    .pfnWDT_Handler = (void *)WDT_Handler,
    .pfnRTC_Handler = (void *)RTC_Handler,
    .pfnEIC_0_Handler = (void *)EIC_0_Handler,
    .pfnEIC_1_Handler = (void *)EIC_1_Handler,
    .pfnEIC_2_Handler = (void *)EIC_2_Handler,
    .pfnEIC_3_Handler = (void *)EIC_3_Handler,
    .pfnEIC_4_Handler = (void *)EIC_4_Handler,
    .pfnEIC_5_Handler = (void *)EIC_5_Handler,
    .pfnEIC_6_Handler = (void *)EIC_6_Handler,
    .pfnEIC_7_Handler = (void *)EIC_7_Handler,
    .pfnEIC_8_Handler = (void *)EIC_8_Handler,
    .pfnEIC_9_Handler = (void *)EIC_9_Handler,
    .pfnEIC_10_Handler = (void *)EIC_10_Handler,
    .pfnEIC_11_Handler = (void *)EIC_11_Handler,
    .pfnEIC_12_Handler = (void *)EIC_12_Handler,
    .pfnEIC_13_Handler = (void *)EIC_13_Handler,
    .pfnEIC_14_Handler = (void *)EIC_14_Handler,
    .pfnEIC_15_Handler = (void *)EIC_15_Handler,
    .pfnFREQM_Handler = (void *)FREQM_Handler,
    .pfnNVMCTRL_0_Handler = (void *)NVMCTRL_0_Handler,
    .pfnNVMCTRL_1_Handler = (void *)NVMCTRL_1_Handler,
    .pfnDMAC_0_Handler = (void *)DMAC_0_Handler,
    .pfnDMAC_1_Handler = (void *)DMAC_1_Handler,
    .pfnDMAC_2_Handler = (void *)DMAC_2_Handler,
    .pfnDMAC_3_Handler = (void *)DMAC_3_Handler,
    .pfnDMAC_4_Handler = (void *)DMAC_4_Handler,
    .pfnEVSYS_0_Handler = (void *)EVSYS_0_Handler,
    .pfnEVSYS_1_Handler = (void *)EVSYS_1_Handler,
    .pfnEVSYS_2_Handler = (void *)EVSYS_2_Handler,
    .pfnEVSYS_3_Handler = (void *)EVSYS_3_Handler,
    .pfnEVSYS_4_Handler = (void *)EVSYS_4_Handler,
    .pfnPAC_Handler = (void *)PAC_Handler,

