rlcamp/samd51_strobe/samd51_init.c
    .pfnRAMECC_Handler = (void *)RAMECC_Handler,
    .pfnSERCOM0_0_Handler = (void *)SERCOM0_0_Handler,
    .pfnSERCOM0_1_Handler = (void *)SERCOM0_1_Handler,
    .pfnSERCOM0_2_Handler = (void *)SERCOM0_2_Handler,
    .pfnSERCOM0_3_Handler = (void *)SERCOM0_3_Handler,
    .pfnSERCOM1_0_Handler = (void *)SERCOM1_0_Handler,
    .pfnSERCOM1_1_Handler = (void *)SERCOM1_1_Handler,
    .pfnSERCOM1_2_Handler = (void *)SERCOM1_2_Handler,
    .pfnSERCOM1_3_Handler = (void *)SERCOM1_3_Handler,
    .pfnSERCOM2_0_Handler = (void *)SERCOM2_0_Handler,
    .pfnSERCOM2_1_Handler = (void *)SERCOM2_1_Handler,
    .pfnSERCOM2_2_Handler = (void *)SERCOM2_2_Handler,
    .pfnSERCOM2_3_Handler = (void *)SERCOM2_3_Handler,
    .pfnSERCOM3_0_Handler = (void *)SERCOM3_0_Handler,
    .pfnSERCOM3_1_Handler = (void *)SERCOM3_1_Handler,
    .pfnSERCOM3_2_Handler = (void *)SERCOM3_2_Handler,
    .pfnSERCOM3_3_Handler = (void *)SERCOM3_3_Handler,
    .pfnSERCOM4_0_Handler = (void *)SERCOM4_0_Handler,
    .pfnSERCOM4_1_Handler = (void *)SERCOM4_1_Handler,
    .pfnSERCOM4_2_Handler = (void *)SERCOM4_2_Handler,
    .pfnSERCOM4_3_Handler = (void *)SERCOM4_3_Handler,
    .pfnSERCOM5_0_Handler = (void *)SERCOM5_0_Handler,
    .pfnSERCOM5_1_Handler = (void *)SERCOM5_1_Handler,
    .pfnSERCOM5_2_Handler = (void *)SERCOM5_2_Handler,
    .pfnSERCOM5_3_Handler = (void *)SERCOM5_3_Handler,
#ifdef ID_SERCOM6
    .pfnSERCOM6_0_Handler = (void *)SERCOM6_0_Handler,
    .pfnSERCOM6_1_Handler = (void *)SERCOM6_1_Handler,
    .pfnSERCOM6_2_Handler = (void *)SERCOM6_2_Handler,
    .pfnSERCOM6_3_Handler = (void *)SERCOM6_3_Handler,
#ifdef ID_SERCOM7
    .pfnSERCOM7_0_Handler = (void *)SERCOM7_0_Handler,
    .pfnSERCOM7_1_Handler = (void *)SERCOM7_1_Handler,
    .pfnSERCOM7_2_Handler = (void *)SERCOM7_2_Handler,
    .pfnSERCOM7_3_Handler = (void *)SERCOM7_3_Handler,
#endif
#endif

#ifdef ID_CAN0
    .pfnCAN0_Handler = (void *)CAN0_Handler,
#ifdef ID_CAN1
    .pfnCAN1_Handler = (void *)CAN1_Handler,
#endif
#endif

    .pfnUSB_0_Handler = (void *)USB_0_Handler,
    .pfnUSB_1_Handler = (void *)USB_1_Handler,
    .pfnUSB_2_Handler = (void *)USB_2_Handler,
    .pfnUSB_3_Handler = (void *)USB_3_Handler,

    .pfnTCC0_0_Handler = (void *)TCC0_0_Handler,
    .pfnTCC0_1_Handler = (void *)TCC0_1_Handler,
    .pfnTCC0_2_Handler = (void *)TCC0_2_Handler,
    .pfnTCC0_3_Handler = (void *)TCC0_3_Handler,
    .pfnTCC0_4_Handler = (void *)TCC0_4_Handler,
    .pfnTCC0_5_Handler = (void *)TCC0_5_Handler,
    .pfnTCC0_6_Handler = (void *)TCC0_6_Handler,
    .pfnTCC1_0_Handler = (void *)TCC1_0_Handler,
    .pfnTCC1_1_Handler = (void *)TCC1_1_Handler,
    .pfnTCC1_2_Handler = (void *)TCC1_2_Handler,
    .pfnTCC1_3_Handler = (void *)TCC1_3_Handler,
    .pfnTCC1_4_Handler = (void *)TCC1_4_Handler,
    .pfnTCC2_0_Handler = (void *)TCC2_0_Handler,
    .pfnTCC2_1_Handler = (void *)TCC2_1_Handler,
    .pfnTCC2_2_Handler = (void *)TCC2_2_Handler,
    .pfnTCC2_3_Handler = (void *)TCC2_3_Handler,
#ifdef ID_TCC3
    .pfnTCC3_0_Handler = (void *)TCC3_0_Handler,
    .pfnTCC3_1_Handler = (void *)TCC3_1_Handler,
    .pfnTCC3_2_Handler = (void *)TCC3_2_Handler,
#ifdef ID_TCC4
    .pfnTCC4_0_Handler = (void *)TCC4_0_Handler,
    .pfnTCC4_1_Handler = (void *)TCC4_1_Handler,
    .pfnTCC4_2_Handler = (void *)TCC4_2_Handler,
#endif
#endif

    .pfnTC0_Handler = (void *)TC0_Handler,
    .pfnTC1_Handler = (void *)TC1_Handler,
    .pfnTC2_Handler = (void *)TC2_Handler,
    .pfnTC3_Handler = (void *)TC3_Handler,
#ifdef ID_TC4
    .pfnTC4_Handler = (void *)TC4_Handler,
#ifdef ID_TC5
    .pfnTC5_Handler = (void *)TC5_Handler,
#ifdef ID_TC6
    .pfnTC6_Handler = (void *)TC6_Handler,
#ifdef ID_TC7
    .pfnTC7_Handler = (void *)TC7_Handler,
#endif
#endif
#endif
#endif
    .pfnPDEC_0_Handler = (void *)PDEC_0_Handler,
    .pfnPDEC_1_Handler = (void *)PDEC_1_Handler,
    .pfnPDEC_2_Handler = (void *)PDEC_2_Handler,
    .pfnADC0_0_Handler = (void *)ADC0_0_Handler,
    .pfnADC0_1_Handler = (void *)ADC0_1_Handler,
    .pfnADC1_0_Handler = (void *)ADC1_0_Handler,
    .pfnADC1_1_Handler = (void *)ADC1_1_Handler,
    .pfnAC_Handler = (void *)AC_Handler,
    .pfnDAC_0_Handler = (void *)DAC_0_Handler,
    .pfnDAC_1_Handler = (void *)DAC_1_Handler,
    .pfnDAC_2_Handler = (void *)DAC_2_Handler,
    .pfnDAC_3_Handler = (void *)DAC_3_Handler,
    .pfnDAC_4_Handler = (void *)DAC_4_Handler,
#ifdef ID_I2S
    .pfnI2S_Handler = (void *)I2S_Handler,
#endif
    .pfnPCC_Handler = (void *)PCC_Handler,
    .pfnAES_Handler = (void *)AES_Handler,
    .pfnTRNG_Handler = (void *)TRNG_Handler,
    .pfnICM_Handler = (void *)ICM_Handler,
    .pfnPUKCC_Handler = (void *)PUKCC_Handler,
    .pfnQSPI_Handler = (void *)QSPI_Handler,
    .pfnSDHC0_Handler = (void *)SDHC0_Handler,
#ifdef ID_SDHC1
    .pfnSDHC1_Handler = (void *)SDHC1_Handler,
#endif
};

/* everything below attempts to provide a useful subset of adafruit's startup environment */

/* deviation from adafruit/arduino: note that the adafruit core uses GCLKs 2 and 4 for 100
 and 1 MHz respectively, we don't, but we should probably not reuse those two GCLKs for
 other clock frequencies */

static void switch_cpu_to_32kHz(void) {
#ifdef CRYSTALLESS
    OSC32KCTRL->OSCULP32K.bit.EN32K = 1;
#else
    /* enable 32 kHz xtal oscillator */
    OSC32KCTRL->XOSC32K.reg = (OSC32KCTRL_XOSC32K_Type) { .bit = {
        .ENABLE = 1, .EN1K = 1, .EN32K = 1,
        .CGM = OSC32KCTRL_XOSC32K_CGM_XT_Val,
        .XTALEN = 1
    }}.reg;
    while (!OSC32KCTRL->STATUS.bit.XOSC32KRDY);
#endif

    /* reset gclk peripheral */
    GCLK->CTRLA.bit.SWRST = 1;
    while (GCLK->SYNCBUSY.bit.SWRST);

    /* one or the other of the 32 kHz oscillators will be generic clock generator 3 */
#ifndef CRYSTALLESS
    GCLK->GENCTRL[3].reg = (GCLK_GENCTRL_Type) { .bit = { .SRC = GCLK_GENCTRL_SRC_XOSC32K_Val, .GENEN = 1 }}.reg;
#else
    GCLK->GENCTRL[3].reg = (GCLK_GENCTRL_Type) { .bit = { .SRC = GCLK_GENCTRL_SRC_OSCULP32K_Val, .GENEN = 1 }}.reg;
#endif

    while (GCLK->SYNCBUSY.bit.GENCTRL3);

    /* temporarily use the ulp oscillator for generic clock 0 */
    GCLK->GENCTRL[0].reg = (GCLK_GENCTRL_Type) { .bit = { .SRC = GCLK_GENCTRL_SRC_OSCULP32K_Val, .GENEN = 1 }}.reg;
    while (GCLK->SYNCBUSY.reg & GCLK_SYNCBUSY_GENCTRL0);
}

static void switch_cpu_from_32kHz_to_fast(void) {
    /* bring up dfll in open loop mode */

    OSCCTRL->DFLLCTRLA.reg = 0;

    OSCCTRL->DFLLMUL.reg = (OSCCTRL_DFLLMUL_Type) { .bit = { .CSTEP = 0x1, .FSTEP = 0x1, .MUL = 0 }}.reg;
    while (OSCCTRL->DFLLSYNC.reg & OSCCTRL_DFLLSYNC_DFLLMUL);

