rlcamp/samd51_strobe/samd51_init.c
    OSCCTRL->DFLLCTRLB.reg = 0;
    while (OSCCTRL->DFLLSYNC.reg & OSCCTRL_DFLLSYNC_DFLLCTRLB);

    OSCCTRL->DFLLCTRLA.bit.ENABLE = 1;
    while (OSCCTRL->DFLLSYNC.reg & OSCCTRL_DFLLSYNC_ENABLE);

    /* chip errata 2.8.3 workaround says to set dfllmul, then clear ctrlb to select open loop, then
     enable the dfll, then do this weird dfllval reload thing, then set dfllctrlb to final value */
    OSCCTRL->DFLLVAL.reg = OSCCTRL->DFLLVAL.reg;
    while (OSCCTRL->DFLLSYNC.bit.DFLLVAL);

    OSCCTRL->DFLLCTRLB.reg = (OSCCTRL_DFLLCTRLB_Type) { .bit = { .WAITLOCK = 1, .CCDIS = 1 }}.reg;
    while (!OSCCTRL->STATUS.bit.DFLLRDY);

    if (48000000 == F_CPU)
    /* use the 48 MHz clock for the cpu */
        GCLK->GENCTRL[0].reg = (GCLK_GENCTRL_Type) { .bit = { .SRC = GCLK_GENCTRL_SRC_DFLL_Val, .GENEN = 1 }}.reg;
    else {
        /* divide by 48 to get a 1 MHz clock for generic clock generator 5 */
        GCLK->GENCTRL[5].reg = (GCLK_GENCTRL_Type) { .bit = { .SRC = GCLK_GENCTRL_SRC_DFLL_Val, .GENEN = 1, .DIV = 48U }}.reg;
        while (GCLK->SYNCBUSY.bit.GENCTRL5);

        /* set up fdpll0 at F_CPU (120 MHz) */
        GCLK->PCHCTRL[OSCCTRL_GCLK_ID_FDPLL0].reg = (GCLK_PCHCTRL_Type) { .bit = { .GEN = GCLK_PCHCTRL_GEN_GCLK5_Val, .CHEN = 1 }}.reg;

        OSCCTRL->Dpll[0].DPLLRATIO.reg = (OSCCTRL_DPLLRATIO_Type) { .bit = { .LDRFRAC = 0x00, .LDR = (F_CPU - 500000) / 1000000 }}.reg;
        while (OSCCTRL->Dpll[0].DPLLSYNCBUSY.bit.DPLLRATIO);

        /* must use lbypass due to chip errata 2.13.1 */
        OSCCTRL->Dpll[0].DPLLCTRLB.reg = (OSCCTRL_DPLLCTRLB_Type) { .bit = { .REFCLK = OSCCTRL_DPLLCTRLB_REFCLK_GCLK_Val, . LBYPASS = 1 }}.reg;

        OSCCTRL->Dpll[0].DPLLCTRLA.reg = (OSCCTRL_DPLLCTRLA_Type) { .bit.ENABLE = 1 }.reg;
        while (OSCCTRL->Dpll[0].DPLLSTATUS.bit.CLKRDY == 0 || OSCCTRL->Dpll[0].DPLLSTATUS.bit.LOCK == 0);

        /* 48 MHz clock, required for usb and many other things */
        GCLK->GENCTRL[1].reg = (GCLK_GENCTRL_Type) { .bit = { .SRC = GCLK_GENCTRL_SRC_DFLL_Val, .GENEN = 1, .IDC = 1 }}.reg;
        while (GCLK->SYNCBUSY.reg & GCLK_SYNCBUSY_GENCTRL1);

        /* use the 120 MHz clock for the cpu */
        GCLK->GENCTRL[0].reg = (GCLK_GENCTRL_Type) { .bit = { .SRC = GCLK_GENCTRL_SRC_DPLL0_Val, .GENEN = 1, .IDC = 1 }}.reg;
    }

    while (GCLK->SYNCBUSY.reg & GCLK_SYNCBUSY_GENCTRL0);

    /* with no divider */
    MCLK->CPUDIV.reg = MCLK_CPUDIV_DIV_DIV1;
}

void SystemInit(void) {
    /* zero wait states */
    NVMCTRL->CTRLA.bit.RWS = 0;

    switch_cpu_to_32kHz();
    switch_cpu_from_32kHz_to_fast();

    /* use ldo regulator */
    SUPC->VREG.bit.SEL = 0;

    /* enable cache */
    __disable_irq();
    CMCC->CTRL.reg = 1;
    __enable_irq();

    /* shut off 32 kHz oscillators we're not using */
#ifdef CRYSTALLESS
    OSC32KCTRL->XOSC32K.reg = 0;
#else
    OSC32KCTRL->OSCULP32K.reg &= ~(OSC32KCTRL_OSCULP32K_EN32K | OSC32KCTRL_OSCULP32K_EN1K);
#endif

    /* deviation from adafruit/arduino: omitted debugging stuff */

    /* load ac calibration bias */
    AC->CALIB.reg = (AC_CALIB_Type) { .bit.BIAS0 = (*((uint32_t *)AC_FUSES_BIAS0_ADDR) & AC_FUSES_BIAS0_Msk) >> AC_FUSES_BIAS0_Pos }.reg;

    /* load adc calibration stuff */
    ADC0->CALIB.reg = (ADC_CALIB_Type) { .bit = {
        .BIASREFBUF = (*((uint32_t *)ADC0_FUSES_BIASREFBUF_ADDR) & ADC0_FUSES_BIASREFBUF_Msk) >> ADC0_FUSES_BIASREFBUF_Pos,
        .BIASR2R = (*((uint32_t *)ADC0_FUSES_BIASR2R_ADDR) & ADC0_FUSES_BIASR2R_Msk) >> ADC0_FUSES_BIASR2R_Pos,
        .BIASCOMP = (*((uint32_t *)ADC0_FUSES_BIASCOMP_ADDR) & ADC0_FUSES_BIASCOMP_Msk) >> ADC0_FUSES_BIASCOMP_Pos
    }}.reg;

    ADC1->CALIB.reg = (ADC_CALIB_Type) { .bit = {
        .BIASREFBUF = (*((uint32_t *)ADC1_FUSES_BIASREFBUF_ADDR) & ADC1_FUSES_BIASREFBUF_Msk) >> ADC1_FUSES_BIASREFBUF_Pos,
        .BIASR2R = (*((uint32_t *)ADC1_FUSES_BIASR2R_ADDR) & ADC1_FUSES_BIASR2R_Msk) >> ADC1_FUSES_BIASR2R_Pos,
        .BIASCOMP = (*((uint32_t *)ADC1_FUSES_BIASCOMP_ADDR) & ADC1_FUSES_BIASCOMP_Msk) >> ADC1_FUSES_BIASCOMP_Pos
    }}.reg;

    /* load usb calibration stuff */
    USB->DEVICE.PADCAL.reg = (USB_PADCAL_Type) { .bit = {
        .TRANSN = (*((uint32_t *)USB_FUSES_TRANSN_ADDR) & USB_FUSES_TRANSN_Msk) >> USB_FUSES_TRANSN_Pos,
        .TRANSP = (*((uint32_t *)USB_FUSES_TRANSP_ADDR) & USB_FUSES_TRANSP_Msk) >> USB_FUSES_TRANSP_Pos,
        .TRIM = (*((uint32_t *)USB_FUSES_TRIM_ADDR) & USB_FUSES_TRIM_Msk) >> USB_FUSES_TRIM_Pos
    }}.reg;

    /* explicitly disable usb just in case the bootloader left it enabled */
    USB->DEVICE.CTRLA.bit.ENABLE = 0;
}

/* silence compiler warning about no previous prototype */
extern void _init(void);

/* newlib calls this from within __libc_init_array */
__attribute((weak)) void _init(void) { }
